import type { Color } from './types'

export const colors: Record<string, Color> = {
  แดงชาด: {
    b: 'bg-แดงชาด',
    l: 'แดงชาด',
  },
  หงชาด: {
    b: 'bg-หงชาด',
    l: 'หงชาด',
  },
  ดินแดง: {
    b: 'bg-ดินแดง',
    l: 'ดินแดง',
  },
  ดินแดงเทศ: {
    b: 'bg-ดินแดงเทศ',
    l: 'ดินแดงเทศ',
  },
  ดินแดงตัด: {
    b: 'bg-ดินแดงตัด',
    l: 'ดินแดงตัด',
  },
  แดงตัด: {
    b: 'bg-แดงตัด',
    l: 'แดงตัด',
  },
  หงดินตัด: {
    b: 'bg-หงดินตัด',
    l: 'หงดินตัด',
  },
  หงดิน: {
    b: 'bg-หงดิน',
    l: 'หงดิน',
  },
  หงสบาท: {
    b: 'bg-หงสบาท',
    l: 'หงสบาท',
  },
  ผุ่นแดง: {
    b: 'bg-ผุ่นแดง',
    l: 'ผุ่นแดง',
  },
  ก้ามปูหลุด: {
    b: 'bg-ก้ามปูหลุด',
    l: 'ก้ามปูหลุด',
  },
  บัวโรย: {
    b: 'bg-บัวโรย',
    l: 'บัวโรย',
  },
  ท้องสิงห์: {
    b: 'bg-ท้องสิงห์',
    l: 'ท้องสิงห์',
  },
  ดอกอุบล: {
    b: 'bg-ดอกอุบล',
    l: 'ดอกอุบล',
  },
  แดงดอกกระมุท: {
    b: 'bg-แดงดอกกระมุท',
    l: 'แดงดอกกระมุท',
  },
  ลิ้นจี่: {
    b: 'bg-ลิ้นจี่',
    l: 'ลิ้นจี่',
  },
  แดงดอกชบา: {
    b: 'bg-แดงดอกชบา',
    l: 'แดงดอกชบา',
  },
  น้ำครั่ง: {
    b: 'bg-น้ำครั่ง',
    l: 'น้ำครั่ง',
  },
  แดงยอ: {
    b: 'bg-แดงยอ',
    l: 'แดงยอ',
  },
  ก้ามปูอสุรา: {
    b: 'bg-ก้ามปูอสุรา',
    l: 'ก้ามปูอสุรา',
  },
  ดอกบานเย็น: {
    b: 'bg-ดอกบานเย็น',
    l: 'ดอกบานเย็น',
  },
  น้ำหมาก: {
    b: 'bg-น้ำหมาก',
    l: 'น้ำหมาก',
  },
  กุหลาบ: {
    b: 'bg-กุหลาบ',
    l: 'กุหลาบ',
  },
  เกสรชมพู่: {
    b: 'bg-เกสรชมพู่',
    l: 'เกสรชมพู่',
  },
  แดงมณี: {
    b: 'bg-แดงมณี',
    l: 'แดงมณี',
  },
  นิลุบล: {
    b: 'bg-นิลุบล',
    l: 'นิลุบล',
  },
  เสน: {
    b: 'bg-เสน',
    l: 'เสน',
  },
  หงเสน: {
    b: 'bg-หงเสน',
    l: 'หงเสน',
  },
  ลูกพิกุล: {
    b: 'bg-ลูกพิกุล',
    l: 'ลูกพิกุล',
  },
  เมฆสนทยา: {
    b: 'bg-เมฆสนทยา',
    l: 'เมฆสนทยา',
  },
  ก้านดอกกรรณิการ์: {
    b: 'bg-ก้านดอกกรรณิการ์',
    l: 'ก้านดอกกรรณิการ์',
  },
  ภูอัคนี: {
    b: 'bg-ภูอัคนี',
    l: 'ภูอัคนี',
  },
  หมากสุก: {
    b: 'bg-หมากสุก',
    l: 'หมากสุก',
  },
  ดอกทับทิม: {
    b: 'bg-ดอกทับทิม',
    l: 'ดอกทับทิม',
  },
  น้ำผึ้ง: {
    b: 'bg-น้ำผึ้ง',
    l: 'น้ำผึ้ง',
  },
  หม้อใหม่: {
    b: 'bg-หม้อใหม่',
    l: 'หม้อใหม่',
  },
  รงทอง: {
    b: 'bg-รงทอง',
    l: 'รงทอง',
  },
  หรดาล: {
    b: 'bg-หรดาล',
    l: 'หรดาล',
    d: true,
  },
  เปลือกข้าวโพด: {
    b: 'bg-เปลือกข้าวโพด',
    l: 'เปลือกข้าวโพด',
  },
  เลื่อมประภัสสร: {
    b: 'bg-เลื่อมประภัสสร',
    l: 'เลื่อมประภัสสร',
  },
  จันทร์: {
    b: 'bg-จันทร์',
    l: 'จันทร์',
  },
  จำปา: {
    b: 'bg-จำปา',
    l: 'จำปา',
  },
  เหลืองดิน: {
    b: 'bg-เหลืองดิน',
    l: 'เหลืองดิน',
  },
  ดอกบวบ: {
    b: 'bg-ดอกบวบ',
    l: 'ดอกบวบ',
    d: true,
  },
  ไม้กฤษณา: {
    b: 'bg-ไม้กฤษณา',
    l: 'ไม้กฤษณา',
  },
  เหลืองไพล: {
    b: 'bg-เหลืองไพล',
    l: 'เหลืองไพล',
  },
  ลูกจันทร์: {
    b: 'bg-ลูกจันทร์',
    l: 'ลูกจันทร์',
  },
  มุกสุข: {
    b: 'bg-มุกสุข',
    l: 'มุกสุข',
  },
  ขี้ผึ้ง: {
    b: 'bg-ขี้ผึ้ง',
    l: 'ขี้ผึ้ง',
  },
  เนื้อ: {
    b: 'bg-เนื้อ',
    l: 'เนื้อ',
  },
  มะตูมสุก: {
    b: 'bg-มะตูมสุก',
    l: 'มะตูมสุก',
  },
  เขียวไพร: {
    b: 'bg-เขียวไพร',
    l: 'เขียวไพร',
  },
  เขียวตั้งแช: {
    b: 'bg-เขียวตั้งแช',
    l: 'เขียวตั้งแช',
  },
  เขียวขี้ทอง: {
    b: 'bg-เขียวขี้ทอง',
    l: 'เขียวขี้ทอง',
  },
  เขียวขี้ม้า: {
    b: 'bg-เขียวขี้ม้า',
    l: 'เขียวขี้ม้า',
  },
  เขียวขาบ: {
    b: 'bg-เขียวขาบ',
    l: 'เขียวขาบ',
  },
  เขียวก้านตอง: {
    b: 'bg-เขียวก้านตอง',
    l: 'เขียวก้านตอง',
  },
  เขียวนวล: {
    b: 'bg-เขียวนวล',
    l: 'เขียวนวล',
  },
  เขียวก้ามปู: {
    b: 'bg-เขียวก้ามปู',
    l: 'เขียวก้ามปู',
  },
  เขียวดิน: {
    b: 'bg-เขียวดิน',
    l: 'เขียวดิน',
  },
  เขียวไข่ครุฑ: {
    b: 'bg-เขียวไข่ครุฑ',
    l: 'เขียวไข่ครุฑ',
  },
  ตองอ่อน: {
    b: 'bg-ตองอ่อน',
    l: 'ตองอ่อน',
  },
  เขียวตอง: {
    b: 'bg-เขียวตอง',
    l: 'เขียวตอง',
  },
  เขียวขจี: {
    b: 'bg-เขียวขจี',
    l: 'เขียวขจี',
  },
  เขียวไบแค: {
    b: 'bg-เขียวไบแค',
    l: 'เขียวไบแค',
  },
  ก้านมะลิ: {
    b: 'bg-ก้านมะลิ',
    l: 'ก้านมะลิ',
  },
  เขียวไข่กา: {
    b: 'bg-เขียวไข่กา',
    l: 'เขียวไข่กา',
  },
  ไม้ไผ่: {
    b: 'bg-ไม้ไผ่',
    l: 'ไม้ไผ่',
  },
  เขียวถั่ว: {
    b: 'bg-เขียวถั่ว',
    l: 'เขียวถั่ว',
  },
  เขียวนกกะลิง: {
    b: 'bg-เขียวนกกะลิง',
    l: 'เขียวนกกะลิง',
  },
  เขียวตะพุ่น: {
    b: 'bg-เขียวตะพุ่น',
    l: 'เขียวตะพุ่น',
  },
  เขียวขี้นกการเวท: {
    b: 'bg-เขียวขี้นกการเวท',
    l: 'เขียวขี้นกการเวท',
  },
  มหาดไทย: {
    b: 'bg-มหาดไทย',
    l: 'มหาดไทย',
  },
  เขียวน้ำไหล: {
    b: 'bg-เขียวน้ำไหล',
    l: 'เขียวน้ำไหล',
  },
  หญ้าแพรกอ่อน: {
    b: 'bg-หญ้าแพรกอ่อน',
    l: 'หญ้าแพรกอ่อน',
  },
  มรกต: {
    b: 'bg-มรกต',
    l: 'มรกต',
  },
  เขียวมะพูด: {
    b: 'bg-เขียวมะพูด',
    l: 'เขียวมะพูด',
  },
  โศก: {
    b: 'bg-โศก',
    l: 'โศก',
  },
  เขียวรงกา: {
    b: 'bg-เขียวรงกา',
    l: 'เขียวรงกา',
  },
  คราม: {
    b: 'bg-คราม',
    l: 'คราม',
  },
  ครามฝรั่ง: {
    b: 'bg-ครามฝรั่ง',
    l: 'ครามฝรั่ง',
  },
  มอคราม: {
    b: 'bg-มอคราม',
    l: 'มอคราม',
  },
  เมฆคราม: {
    b: 'bg-เมฆคราม',
    l: 'เมฆคราม',
  },
  เมฆ: {
    b: 'bg-เมฆ',
    l: 'เมฆ',
  },
  ตากุ้ง: {
    b: 'bg-ตากุ้ง',
    l: 'ตากุ้ง',
  },
  ขาบ: {
    b: 'bg-ขาบ',
    l: 'ขาบ',
  },
  ขาบดำ: {
    b: 'bg-ขาบดำ',
    l: 'ขาบดำ',
  },
  เข้มขาบ: {
    b: 'bg-เข้มขาบ',
    l: 'เข้มขาบ',
  },
  น้ำไหล: {
    b: 'bg-น้ำไหล',
    l: 'น้ำไหล',
  },
  ขนคอนางนกยูง: {
    b: 'bg-ขนคอนางนกยูง',
    l: 'ขนคอนางนกยูง',
  },
  กลาโหม: {
    b: 'bg-กลาโหม',
    l: 'กลาโหม',
  },
  ตาแมว: {
    b: 'bg-ตาแมว',
    l: 'ตาแมว',
  },
  กรมท่า: {
    b: 'bg-กรมท่า',
    l: 'กรมท่า',
  },
  น้ำเงินนกพิราบ: {
    b: 'bg-น้ำเงินนกพิราบ',
    l: 'น้ำเงินนกพิราบ',
  },
  ฟ้า: {
    b: 'bg-ฟ้า',
    l: 'ฟ้า',
  },
  ม่วงชาด: {
    b: 'bg-ม่วงชาด',
    l: 'ม่วงชาด',
  },
  ม่วงคราม: {
    b: 'bg-ม่วงคราม',
    l: 'ม่วงคราม',
  },
  ม่วงเม็ดมะปราง: {
    b: 'bg-ม่วงเม็ดมะปราง',
    l: 'ม่วงเม็ดมะปราง',
  },
  ม่วงดอกตะแบก: {
    b: 'bg-ม่วงดอกตะแบก',
    l: 'ม่วงดอกตะแบก',
  },
  ม่วงดอกผักตบ: {
    b: 'bg-ม่วงดอกผักตบ',
    l: 'ม่วงดอกผักตบ',
  },
  ม่วงเขียว: {
    b: 'bg-ม่วงเขียว',
    l: 'ม่วงเขียว',
  },
  ม่วงแก่: {
    b: 'bg-ม่วงแก่',
    l: 'ม่วงแก่',
  },
  ดอกอัญชัน: {
    b: 'bg-ดอกอัญชัน',
    l: 'ดอกอัญชัน',
  },
  เผือก: {
    b: 'bg-เผือก',
    l: 'เผือก',
  },
  ม่วงตอง: {
    b: 'bg-ม่วงตอง',
    l: 'ม่วงตอง',
  },
  เปลือกมังคุด: {
    b: 'bg-เปลือกมังคุด',
    l: 'เปลือกมังคุด',
  },
  พวงอังกาบ: {
    b: 'bg-พวงอังกาบ',
    l: 'พวงอังกาบ',
  },
  ลูกหว้า: {
    b: 'bg-ลูกหว้า',
    l: 'ลูกหว้า',
  },
  น้ำตาล: {
    b: 'bg-น้ำตาล',
    l: 'น้ำตาล',
  },
  น้ำตาลไหม้: {
    b: 'bg-น้ำตาลไหม้',
    l: 'น้ำตาลไหม้',
  },
  กะปิ: {
    b: 'bg-กะปิ',
    l: 'กะปิ',
  },
  ฝาด: {
    b: 'bg-ฝาด',
    l: 'ฝาด',
  },
  ฟาง: {
    b: 'bg-ฟาง',
    l: 'ฟาง',
  },
  ดิน: {
    b: 'bg-ดิน',
    l: 'ดิน',
  },
  อิฐ: {
    b: 'bg-อิฐ',
    l: 'อิฐ',
  },
  สัก: {
    b: 'bg-สัก',
    l: 'สัก',
  },
  กรัก: {
    b: 'bg-กรัก',
    l: 'กรัก',
  },
  กากี: {
    b: 'bg-กากี',
    l: 'กากี',
  },
  ทอง: {
    b: 'bg-ทอง',
    l: 'ทอง',
  },
  ทองคำ: {
    b: 'bg-ทองคำ',
    l: 'ทองคำ',
  },
  ทองชมพูนุช: {
    b: 'bg-ทองชมพูนุช',
    l: 'ทองชมพูนุช',
  },
  ทองดอกบวบ: {
    b: 'bg-ทองดอกบวบ',
    l: 'ทองดอกบวบ',
  },
  เหลืองเพียงทอง: {
    b: 'bg-เหลืองเพียงทอง',
    l: 'เหลืองเพียงทอง',
  },
  ทองแดง: {
    b: 'bg-ทองแดง',
    l: 'ทองแดง',
  },
  ทองแดงสุก: {
    b: 'bg-ทองแดงสุก',
    l: 'ทองแดงสุก',
  },
  นาก: {
    b: 'bg-นาก',
    l: 'นาก',
  },
  เลื่อมพราย: {
    b: 'bg-เลื่อมพราย',
    l: 'เลื่อมพราย',
    d: true,
  },
  เลื่อมเหลือง: {
    b: 'bg-เลื่อมเหลือง',
    l: 'เลื่อมเหลือง',
    d: true,
  },
  เงิน: {
    b: 'bg-เงิน',
    l: 'เงิน',
    d: true,
  },
  ขาวปนเพรช: {
    b: 'bg-ขาวปนเพรช',
    l: 'ขาวปนเพรช',
    d: true,
  },
  เหล็ก: {
    b: 'bg-เหล็ก',
    l: 'เหล็ก',
    d: true,
  },
  เหล็กไหล: {
    b: 'bg-เหล็กไหล',
    l: 'เหล็กไหล',
  },
  สัมฤทธิ์ผล: {
    b: 'bg-สัมฤทธิ์ผล',
    l: 'สัมฤทธิ์ผล',
  },
  สัมฤทธิ์โชค: {
    b: 'bg-สัมฤทธิ์โชค',
    l: 'สัมฤทธิ์โชค',
  },
  สัมฤทธิ์ศักดิ์: {
    b: 'bg-สัมฤทธิ์ศักดิ์',
    l: 'สัมฤทธิ์ศักดิ์',
  },
  สัมฤทธิ์คุณ: {
    b: 'bg-สัมฤทธิ์คุณ',
    l: 'สัมฤทธิ์คุณ',
  },
  สัมฤทธิ์เดช: {
    b: 'bg-สัมฤทธิ์เดช',
    l: 'สัมฤทธิ์เดช',
  },
  ดำเขม่า: {
    b: 'bg-ดำเขม่า',
    l: 'ดำเขม่า',
  },
  ดำหมึก: {
    b: 'bg-ดำหมึก',
    l: 'ดำหมึก',
  },
  มอหมึก: {
    b: 'bg-มอหมึก',
    l: 'มอหมึก',
  },
  หมึกจีน: {
    b: 'bg-หมึกจีน',
    l: 'หมึกจีน',
  },
  น้ำรัก: {
    b: 'bg-น้ำรัก',
    l: 'น้ำรัก',
  },
  สัมฤทธิ์: {
    b: 'bg-สัมฤทธิ์',
    l: 'สัมฤทธิ์',
  },
  ปีกกา: {
    b: 'bg-ปีกกา',
    l: 'ปีกกา',
  },
  เขม่ายาง: {
    b: 'bg-เขม่ายาง',
    l: 'เขม่ายาง',
  },
  เทา: {
    b: 'bg-เทา',
    l: 'เทา',
  },
  เหลืองเทา: {
    b: 'bg-เหลืองเทา',
    l: 'เหลืองเทา',
  },
  สวาด: {
    b: 'bg-สวาด',
    l: 'สวาด',
  },
  เขียวนิล: {
    b: 'bg-เขียวนิล',
    l: 'เขียวนิล',
  },
  นิลกาฬ: {
    b: 'bg-นิลกาฬ',
    l: 'นิลกาฬ',
  },
  ดอกเลา: {
    b: 'bg-ดอกเลา',
    l: 'ดอกเลา',
  },
  ลูกห่าน: {
    b: 'bg-ลูกห่าน',
    l: 'ลูกห่าน',
  },
  ควันเพลิง: {
    b: 'bg-ควันเพลิง',
    l: 'ควันเพลิง',
  },
  ปูน: {
    b: 'bg-ปูน',
    l: 'ปูน',
  },
  เทาเขียว: {
    b: 'bg-เทาเขียว',
    l: 'เทาเขียว',
  },
  ขาวผ่อง: {
    b: 'bg-ขาวผ่อง',
    l: 'ขาวผ่อง',
    d: true,
  },
  ขาวกะบัง: {
    b: 'bg-ขาวกะบัง',
    l: 'ขาวกะบัง',
    d: true,
  },
  ฟ้าแลบ: {
    b: 'bg-ฟ้าแลบ',
    l: 'ฟ้าแลบ',
    d: true,
  },
  ควายเผือก: {
    b: 'bg-ควายเผือก',
    l: 'ควายเผือก',
    d: true,
  },
  ช้างเผือก: {
    b: 'bg-ช้างเผือก',
    l: 'ช้างเผือก',
  },
  กลีบบัว: {
    b: 'bg-กลีบบัว',
    l: 'กลีบบัว',
  },
  นวลเทา: {
    b: 'bg-นวลเทา',
    l: 'นวลเทา',
  },
  นวล: {
    b: 'bg-นวล',
    l: 'นวล',
  },
  นวลจันทร์: {
    b: 'bg-นวลจันทร์',
    l: 'นวลจันทร์',
  },
  สังข์: {
    b: 'bg-สังข์',
    l: 'สังข์',
    d: true,
  },
  ขาวขาบ: {
    b: 'bg-ขาวขาบ',
    l: 'ขาวขาบ',
    d: true,
  },
  งาช้าง: {
    b: 'bg-งาช้าง',
    l: 'งาช้าง',
    d: true,
  },
  หมอก: {
    b: 'bg-หมอก',
    l: 'หมอก',
    d: true,
  },
}
